*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:101:9: replace Vault::deposit -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::deposit -> i128 with -1
@@ -93,55 +93,17 @@
         env.storage().instance().set(&DataKey::TotalShares, &0i128);
         Self::bump_instance(&env);
     }
 
     // ── Core operations ──────────────────────────────────────────────────────
 
     /// Deposit `amount` of the underlying token; returns the shares minted.
     pub fn deposit(env: Env, from: Address, amount: i128) -> i128 {
-        from.require_auth();
-        Self::require_not_paused(&env);
-        Self::require_positive(&env, amount);
-
-        let token_addr = Self::token_address(&env);
-        let client = token::TokenClient::new(&env, &token_addr);
-        let vault = env.current_contract_address();
-
-        // Assets held *before* the incoming transfer — the correct basis for
-        // the share price.
-        let assets_before = client.balance(&vault);
-        let total = Self::total_shares_internal(&env);
-
-        let shares = if total == 0 {
-            amount
-        } else {
-            // amount * total / assets_before
-            let numerator = Self::checked_mul(&env, amount, total);
-            if assets_before <= 0 {
-                panic_with_error!(&env, VaultError::InvalidAmount);
-            }
-            numerator / assets_before
-        };
-
-        // I3/I7 — a deposit that mints zero shares is value donated to existing
-        // holders. Rejecting it closes the share-inflation vector (S18).
-        #[cfg(not(feature = "bug_zero_amount"))]
-        if shares <= 0 {
-            panic_with_error!(&env, VaultError::ZeroShares);
-        }
-
-        client.transfer(&from, &vault, &amount);
-
-        let balance = Self::balance_internal(&env, &from);
-        Self::set_balance(&env, &from, Self::checked_add(&env, balance, shares));
-        Self::set_total_shares(&env, Self::checked_add(&env, total, shares));
-        Self::touch(&env, &from);
-
-        shares
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Burn `shares` and return the corresponding amount of the underlying token.
     pub fn withdraw(env: Env, from: Address, shares: i128) -> i128 {
         from.require_auth();
         Self::require_not_paused(&env);
         Self::require_positive(&env, shares);

---- prop_i5_no_auth_cannot_decrease_balance stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i5_no_auth_cannot_decrease_balance" to "test_snapshots/prop_i5_no_auth_cannot_decrease_balance.1.json".
Writing test snapshot file for test "prop_i5_no_auth_cannot_decrease_balance" to "test_snapshots/prop_i5_no_auth_cannot_decrease_balance.2.json".
Writing test snapshot file for test "prop_i5_no_auth_cannot_decrease_balance" to "test_snapshots/prop_i5_no_auth_cannot_decrease_balance.3.json".
Writing test snapshot file for test "prop_i5_no_auth_cannot_decrease_balance" to "test_snapshots/prop_i5_no_auth_cannot_decrease_balance.4.json".
Writing test snapshot file for test "prop_i5_no_auth_cannot_decrease_balance" to "test_snapshots/prop_i5_no_auth_cannot_decrease_balance.5.json".
Writing test snapshot

---- prop_i10_balance_ttl_on_first_write stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i10_balance_ttl_on_first_write" to "test_snapshots/prop_i10_balance_ttl_on_first_write.1.json".
Writing test snapshot file for test "prop_i10_balance_ttl_on_first_write" to "test_snapshots/prop_i10_balance_ttl_on_first_write.2.json".
Writing test snapshot file for test "prop_i10_balance_ttl_on_first_write" to "test_snapshots/prop_i10_balance_ttl_on_first_write.3.json".
Writing test snapshot file for test "prop_i10_balance_ttl_on_first_write" to "test_snapshots/prop_i10_balance_ttl_on_first_write.4.json".
Writing test snapshot file for test "prop_i10_balance_ttl_on_first_write" to "test_snapshots/prop_i10_balance_ttl_on_first_write.5.json".
Writing test snapshot file for test "prop_i10_balance_ttl_on_first

---- prop_i11_temporary_tier_non_interference stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.2.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.1.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.4.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.3.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.6.json".
Writing tes

failures:
    prop_exact_share_accounting
    prop_i10_balance_ttl_on_first_write
    prop_i11_temporary_tier_non_interference
    prop_i12_pause_semantics
    prop_i5_no_auth_cannot_decrease_balance
    prop_n1_instance_ttl
    prop_sequence_state_invariants

test result: FAILED. 4 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 103.80s

*** result: Failure(101)
