*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:164:53: replace / with % in Vault::withdraw

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace / with % in Vault::withdraw
@@ -156,17 +156,17 @@
 
         let total = Self::total_shares_internal(&env);
         let assets = client.balance(&vault);
 
         // amount = shares * assets / total
         let amount = if total == 0 {
             0
         } else {
-            Self::checked_mul(&env, shares, assets) / total
+            Self::checked_mul(&env, shares, assets) % /* ~ changed by cargo-mutants ~ */ total
         };
 
         // Effects before interaction (CEI) — the reentrancy discipline from
         // scenario S02.
         Self::set_balance(&env, &from, Self::checked_sub(&env, balance, shares));
         Self::set_total_shares(&env, Self::checked_sub(&env, total, shares));
 
         if amount > 0 {

---- prop_sequence_state_invariants stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.1.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.2.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.3.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.4.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.5.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.6.

---- prop_exact_share_accounting stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.1.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.2.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.3.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.4.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.5.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.6.json".
Writing test snapshot file for t

failures:
    prop_exact_share_accounting
    prop_sequence_state_invariants

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 47.84s

*** result: Failure(101)
