*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:214:9: replace Vault::set_admin with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::set_admin with ()
@@ -206,19 +206,17 @@
         Self::set_balance(&env, &to, Self::checked_add(&env, to_balance, shares));
         Self::touch(&env, &from);
     }
 
     // ── Admin ────────────────────────────────────────────────────────────────
 
     /// Hand the admin role to `new_admin`. Only the current admin may do this (I4).
     pub fn set_admin(env: Env, new_admin: Address) {
-        Self::require_admin(&env);
-        env.storage().instance().set(&DataKey::Admin, &new_admin);
-        Self::bump_instance(&env);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Halt all state-mutating entry points (I12). Only the admin may do this (I4).
     pub fn pause(env: Env) {
         Self::require_admin(&env);
         env.storage().instance().set(&DataKey::Paused, &true);
         Self::bump_instance(&env);
     }

---- prop_sequence_state_invariants stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.1.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.2.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.3.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.4.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.5.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.6.

---- prop_i4_admin_custody stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.1.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.2.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.3.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.4.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.5.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.6.json".
Writing test snapshot file for test "prop_i4_admin_custody" to "test_snapshots/prop_i4_admin_custody.7.json".

---- prop_i12_pause_semantics stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.1.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.2.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.3.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.4.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.5.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test_snapshots/prop_i12_pause_semantics.6.json".
Writing test snapshot file for test "prop_i12_pause_semantics" to "test

failures:
    prop_i12_pause_semantics
    prop_i4_admin_custody
    prop_sequence_state_invariants

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 64.88s

*** result: Failure(101)
