*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:229:9: replace Vault::total_shares -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::total_shares -> i128 with -1
@@ -221,17 +221,17 @@
         Self::require_admin(&env);
         env.storage().instance().set(&DataKey::Paused, &true);
         Self::bump_instance(&env);
     }
 
     // ── Views ────────────────────────────────────────────────────────────────
 
     pub fn total_shares(env: Env) -> i128 {
-        Self::total_shares_internal(&env)
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn balance_of(env: Env, who: Address) -> i128 {
         Self::balance_internal(&env, &who)
     }
 
     pub fn admin(env: Env) -> Address {
         Self::admin_address(&env)

---- prop_n3_views_are_pure stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.1.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.2.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.3.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.4.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.5.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are_pure.6.json".
Writing test snapshot file for test "prop_n3_views_are_pure" to "test_snapshots/prop_n3_views_are

---- prop_exact_share_accounting stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.1.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.2.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.3.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.4.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.5.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.6.json".
Writing test snapshot file for t

---- prop_sequence_state_invariants stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.1.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.2.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.3.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.4.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.5.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.6.

failures:
    prop_exact_share_accounting
    prop_n3_views_are_pure
    prop_sequence_state_invariants

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 66.05s

*** result: Failure(101)
