*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:233:9: replace Vault::balance_of -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::balance_of -> i128 with -1
@@ -225,17 +225,17 @@
 
     // ── Views ────────────────────────────────────────────────────────────────
 
     pub fn total_shares(env: Env) -> i128 {
         Self::total_shares_internal(&env)
     }
 
     pub fn balance_of(env: Env, who: Address) -> i128 {
-        Self::balance_internal(&env, &who)
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn admin(env: Env) -> Address {
         Self::admin_address(&env)
     }
 
     pub fn is_paused(env: Env) -> bool {
         env.storage()

*** result: Timeout
