*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:252:9: replace Vault::last_activity -> Option<u32> with None

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::last_activity -> Option<u32> with None
@@ -244,17 +244,17 @@
             .unwrap_or(false)
     }
 
     /// Ledger of the address's last vault operation.
     ///
     /// **Non-authoritative.** Lives in temporary storage and may vanish at any
     /// time; nothing in this contract is gated on it (I11).
     pub fn last_activity(env: Env, who: Address) -> Option<u32> {
-        env.storage().temporary().get(&DataKey::LastActivity(who))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ── Internal helpers ─────────────────────────────────────────────────────────
 
 impl Vault {
     fn admin_address(env: &Env) -> Address {
         env.storage()

---- prop_i11_temporary_tier_non_interference stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.1.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.2.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.3.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.4.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.5.json".
Writing tes

failures:
    prop_i11_temporary_tier_non_interference

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 21.93s

*** result: Failure(101)
