*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:327:9: replace Vault::set_total_shares with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::set_total_shares with ()
@@ -319,18 +319,17 @@
     fn total_shares_internal(env: &Env) -> i128 {
         env.storage()
             .instance()
             .get(&DataKey::TotalShares)
             .unwrap_or(0)
     }
 
     fn set_total_shares(env: &Env, value: i128) {
-        env.storage().instance().set(&DataKey::TotalShares, &value);
-        Self::bump_instance(env);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn balance_internal(env: &Env, who: &Address) -> i128 {
         env.storage()
             .persistent()
             .get(&DataKey::Balance(who.clone()))
             .unwrap_or(0)
     }

---- prop_sequence_state_invariants stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.1.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.2.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.3.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.4.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.5.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.6.

---- prop_exact_share_accounting stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.1.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.2.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.3.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.4.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.5.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.6.json".
Writing test snapshot file for t

failures:
    prop_exact_share_accounting
    prop_sequence_state_invariants

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 52.64s

*** result: Failure(101)
