*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:353:9: replace Vault::touch with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::touch with ()
@@ -345,21 +345,17 @@
         #[cfg(not(feature = "bug_no_ttl"))]
         env.storage()
             .persistent()
             .extend_ttl(&key, BUMP_THRESHOLD, BUMP_AMOUNT);
     }
 
     /// Record non-authoritative activity telemetry in the temporary tier.
     fn touch(env: &Env, who: &Address) {
-        let key = DataKey::LastActivity(who.clone());
-        env.storage()
-            .temporary()
-            .set(&key, &env.ledger().sequence());
-        env.storage().temporary().extend_ttl(&key, TEMP_TTL, TEMP_TTL);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn bump_instance(env: &Env) {
         #[cfg(not(feature = "bug_no_ttl"))]
         env.storage()
             .instance()
             .extend_ttl(BUMP_THRESHOLD, BUMP_AMOUNT);
         #[cfg(feature = "bug_no_ttl")]

---- prop_i11_temporary_tier_non_interference stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.1.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.2.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.3.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.4.json".
Writing test snapshot file for test "prop_i11_temporary_tier_non_interference" to "test_snapshots/prop_i11_temporary_tier_non_interference.5.json".
Writing tes

failures:
    prop_i11_temporary_tier_non_interference

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 38.31s

*** result: Failure(101)
