*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:388:9: replace Vault::checked_sub -> i128 with 0

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::checked_sub -> i128 with 0
@@ -380,18 +380,17 @@
             return a.wrapping_add(b);
         }
         #[cfg(not(feature = "bug_overflow"))]
         a.checked_add(b)
             .unwrap_or_else(|| panic_with_error!(env, VaultError::Overflow))
     }
 
     fn checked_sub(env: &Env, a: i128, b: i128) -> i128 {
-        a.checked_sub(b)
-            .unwrap_or_else(|| panic_with_error!(env, VaultError::Overflow))
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn checked_mul(env: &Env, a: i128, b: i128) -> i128 {
         #[cfg(feature = "bug_overflow")]
         {
             let _ = env;
             return a.wrapping_mul(b);
         }

---- prop_i8_transfer_shares stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.1.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.2.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.3.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.4.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.5.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/prop_i8_transfer_shares.6.json".
Writing test snapshot file for test "prop_i8_transfer_shares" to "test_snapshots/pro

---- prop_sequence_state_invariants stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.1.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.2.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.3.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.4.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.5.json".
Writing test snapshot file for test "prop_sequence_state_invariants" to "test_snapshots/prop_sequence_state_invariants.6.

---- prop_exact_share_accounting stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.1.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.2.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.3.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.4.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.5.json".
Writing test snapshot file for test "prop_exact_share_accounting" to "test_snapshots/prop_exact_share_accounting.6.json".
Writing test snapshot file for t

failures:
    prop_exact_share_accounting
    prop_i8_transfer_shares
    prop_sequence_state_invariants

test result: FAILED. 8 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 39.21s

*** result: Failure(101)
