*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:309:9: replace Vault::require_positive with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::require_positive with ()
@@ -301,24 +301,17 @@
         {
             panic_with_error!(env, VaultError::Paused);
         }
     }
 
     fn require_positive(env: &Env, value: i128) {
         // I7 — non-positive amounts must be rejected outright. Accepting them is
         // the `bug_zero_amount` seed.
-        #[cfg(not(feature = "bug_zero_amount"))]
-        if value <= 0 {
-            panic_with_error!(env, VaultError::InvalidAmount);
-        }
-        #[cfg(feature = "bug_zero_amount")]
-        if value < 0 {
-            panic_with_error!(env, VaultError::InvalidAmount);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn total_shares_internal(env: &Env) -> i128 {
         env.storage()
             .instance()
             .get(&DataKey::TotalShares)
             .unwrap_or(0)
     }

*** result: Success
