*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:144:9: replace Vault::withdraw -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::withdraw -> i128 with -1
@@ -136,50 +136,17 @@
         Self::set_total_shares(&env, Self::checked_add(&env, total, shares));
         Self::touch(&env, &from);
 
         shares
     }
 
     /// Burn `shares` and return the corresponding amount of the underlying token.
     pub fn withdraw(env: Env, from: Address, shares: i128) -> i128 {
-        from.require_auth();
-        Self::require_not_paused(&env);
-        Self::require_positive(&env, shares);
-
-        let balance = Self::balance_internal(&env, &from);
-        if balance < shares {
-            panic_with_error!(&env, VaultError::InsufficientBalance);
-        }
-
-        let token_addr = Self::token_address(&env);
-        let client = token::TokenClient::new(&env, &token_addr);
-        let vault = env.current_contract_address();
-
-        let total = Self::total_shares_internal(&env);
-        let assets = client.balance(&vault);
-
-        // amount = shares * assets / total
-        let amount = if total == 0 {
-            0
-        } else {
-            Self::checked_mul(&env, shares, assets) / total
-        };
-
-        // Effects before interaction (CEI) — the reentrancy discipline from
-        // scenario S02.
-        Self::set_balance(&env, &from, Self::checked_sub(&env, balance, shares));
-        Self::set_total_shares(&env, Self::checked_sub(&env, total, shares));
-
-        if amount > 0 {
-            client.transfer(&vault, &from, &amount);
-        }
-        Self::touch(&env, &from);
-
-        amount
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Move `shares` between two holders.
     pub fn transfer_shares(env: Env, from: Address, to: Address, shares: i128) {
         // I5 — the sender must authorize. Dropping this is `bug_missing_auth`,
         // the SOR-001 / Wormhole bug class.
         #[cfg(not(feature = "bug_missing_auth"))]
         from.require_auth();

---- test_invariants::i11_temporary_state_is_never_authoritative stdout ----

thread 'test_invariants::i11_temporary_state_is_never_authoritative' (2920049) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:243:5:
assertion `left == right` failed: withdraw unaffected by lost telemetry
  left: -1
 right: 500
Writing test snapshot file for test "test_invariants::i11_temporary_state_is_never_authoritative" to "test_snapshots/test_invariants/i11_temporary_state_is_never_authoritative.1.json".

---- test_invariants::i12_pause_halts_all_mutations stdout ----

thread 'test_invariants::i12_pause_halts_all_mutations' (2920050) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:257:5:
withdraw
Writing test snapshot file for test "test_invariants::i12_pause_halts_all_mutations" to "test_snapshots/test_invariants/i12_pause_halts_all_mutations.1.json".

---- test::withdraw_returns_assets_and_burns_shares stdout ----

thread 'test::withdraw_returns_assets_and_burns_shares' (2920046) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:49:5:
assertion `left == right` failed
  left: -1
 right: 400
Writing test snapshot file for test "test::withdraw_returns_assets_and_burns_shares" to "test_snapshots/test/withdraw_returns_assets_and_burns_shares.1.json".

failures:
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i12_pause_halts_all_mutations
    test_invariants::i2_zero_supply_iff_empty
    test_invariants::i5_user_operations_require_sender_auth
    test_invariants::i7_non_positive_amounts_rejected

test result: FAILED. 15 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
