*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:122:23: replace / with * in Vault::deposit

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace / with * in Vault::deposit
@@ -114,17 +114,17 @@
         let shares = if total == 0 {
             amount
         } else {
             // amount * total / assets_before
             let numerator = Self::checked_mul(&env, amount, total);
             if assets_before <= 0 {
                 panic_with_error!(&env, VaultError::InvalidAmount);
             }
-            numerator / assets_before
+            numerator * /* ~ changed by cargo-mutants ~ */ assets_before
         };
 
         // I3/I7 — a deposit that mints zero shares is value donated to existing
         // holders. Rejecting it closes the share-inflation vector (S18).
         #[cfg(not(feature = "bug_zero_amount"))]
         if shares <= 0 {
             panic_with_error!(&env, VaultError::ZeroShares);
         }

---- test::deposit_mints_proportionally_on_funded_vault stdout ----

thread 'test::deposit_mints_proportionally_on_funded_vault' (2947279) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:38:5:
assertion `left == right` failed: share price unchanged, so 500 assets buy 500 shares
  left: 500000000
 right: 500
Writing test snapshot file for test "test::deposit_mints_proportionally_on_funded_vault" to "test_snapshots/test/deposit_mints_proportionally_on_funded_vault.1.json".

---- test_invariants::i3_round_trip_never_profits stdout ----

thread 'test_invariants::i3_round_trip_never_profits' (2947349) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:54:5:
round trip returned 13332 for a deposit of 3333 — value was created
Writing test snapshot file for test "test_invariants::i3_round_trip_never_profits" to "test_snapshots/test_invariants/i3_round_trip_never_profits.1.json".

failures:
    test::deposit_mints_proportionally_on_funded_vault
    test_invariants::i3_round_trip_never_profits

test result: FAILED. 20 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.86s

*** result: Failure(101)
