*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:128:19: replace <= with > in Vault::deposit

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace <= with > in Vault::deposit
@@ -120,17 +120,17 @@
                 panic_with_error!(&env, VaultError::InvalidAmount);
             }
             numerator / assets_before
         };
 
         // I3/I7 — a deposit that mints zero shares is value donated to existing
         // holders. Rejecting it closes the share-inflation vector (S18).
         #[cfg(not(feature = "bug_zero_amount"))]
-        if shares <= 0 {
+        if shares > /* ~ changed by cargo-mutants ~ */ 0 {
             panic_with_error!(&env, VaultError::ZeroShares);
         }
 
         client.transfer(&from, &vault, &amount);
 
         let balance = Self::balance_internal(&env, &from);
         Self::set_balance(&env, &from, Self::checked_add(&env, balance, shares));
         Self::set_total_shares(&env, Self::checked_add(&env, total, shares));

---- test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor stdout ----

thread 'test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor' (2950095) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #7)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 7777]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #7)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test_invariants::i1_supply_conservation stdout ----

thread 'test_invariants::i1_supply_conservation' (2950106) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #7)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #7)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #7)],

---- test::deposit_mints_proportionally_on_funded_vault stdout ----

thread 'test::deposit_mints_proportionally_on_funded_vault' (2950094) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #7)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #7)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #7)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error,

failures:
    test::deposit_mints_one_to_one_on_empty_vault
    test::deposit_mints_proportionally_on_funded_vault
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::transfer_shares_moves_balance
    test::views_report_state
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i10_persistent_entries_are_ttl_managed_not_restored
    test_invariants::i10_restoration_signature_is_detectable
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i12_pause_halts_all_mutations
    test_invariants::i1_supply_conservation
    test_invariants::i2_zero_supply_iff_empty

test result: FAILED. 5 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
