*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:149:20: replace < with <= in Vault::withdraw

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace < with <= in Vault::withdraw
@@ -141,17 +141,17 @@
 
     /// Burn `shares` and return the corresponding amount of the underlying token.
     pub fn withdraw(env: Env, from: Address, shares: i128) -> i128 {
         from.require_auth();
         Self::require_not_paused(&env);
         Self::require_positive(&env, shares);
 
         let balance = Self::balance_internal(&env, &from);
-        if balance < shares {
+        if balance <= /* ~ changed by cargo-mutants ~ */ shares {
             panic_with_error!(&env, VaultError::InsufficientBalance);
         }
 
         let token_addr = Self::token_address(&env);
         let client = token::TokenClient::new(&env, &token_addr);
         let vault = env.current_contract_address();
 
         let total = Self::total_shares_internal(&env);

---- test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor stdout ----

thread 'test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor' (2958738) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", withdraw, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 7777]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test_invariants::i2_zero_supply_iff_empty stdout ----

thread 'test_invariants::i2_zero_supply_iff_empty' (2958768) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", withdraw, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract,

---- test_invariants::i3_round_trip_never_profits stdout ----

thread 'test_invariants::i3_round_trip_never_profits' (2958770) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", withdraw, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 3333]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Cont

failures:
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test_invariants::i2_zero_supply_iff_empty
    test_invariants::i3_round_trip_never_profits

test result: FAILED. 19 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
