*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:161:31: replace == with != in Vault::withdraw

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace == with != in Vault::withdraw
@@ -153,17 +153,17 @@
         let token_addr = Self::token_address(&env);
         let client = token::TokenClient::new(&env, &token_addr);
         let vault = env.current_contract_address();
 
         let total = Self::total_shares_internal(&env);
         let assets = client.balance(&vault);
 
         // amount = shares * assets / total
-        let amount = if total == 0 {
+        let amount = if total != /* ~ changed by cargo-mutants ~ */ 0 {
             0
         } else {
             Self::checked_mul(&env, shares, assets) / total
         };
 
         // Effects before interaction (CEI) — the reentrancy discipline from
         // scenario S02.
         Self::set_balance(&env, &from, Self::checked_sub(&env, balance, shares));

---- test::withdraw_returns_assets_and_burns_shares stdout ----

thread 'test::withdraw_returns_assets_and_burns_shares' (2959484) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:49:5:
assertion `left == right` failed
  left: 0
 right: 400
Writing test snapshot file for test "test::withdraw_returns_assets_and_burns_shares" to "test_snapshots/test/withdraw_returns_assets_and_burns_shares.1.json".

---- test_invariants::i11_temporary_state_is_never_authoritative stdout ----

thread 'test_invariants::i11_temporary_state_is_never_authoritative' (2959487) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:243:5:
assertion `left == right` failed: withdraw unaffected by lost telemetry
  left: 0
 right: 500
Writing test snapshot file for test "test_invariants::i11_temporary_state_is_never_authoritative" to "test_snapshots/test_invariants/i11_temporary_state_is_never_authoritative.1.json".

---- test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor stdout ----

thread 'test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor' (2959478) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:104:5:
assertion `left == right` failed
  left: 0
 right: 7777
Writing test snapshot file for test "test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor" to "test_snapshots/test/deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor.1.json".

failures:
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i2_zero_supply_iff_empty

test result: FAILED. 18 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
