*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:172:19: replace > with == in Vault::withdraw

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace > with == in Vault::withdraw
@@ -164,17 +164,17 @@
             Self::checked_mul(&env, shares, assets) / total
         };
 
         // Effects before interaction (CEI) — the reentrancy discipline from
         // scenario S02.
         Self::set_balance(&env, &from, Self::checked_sub(&env, balance, shares));
         Self::set_total_shares(&env, Self::checked_sub(&env, total, shares));
 
-        if amount > 0 {
+        if amount == /* ~ changed by cargo-mutants ~ */ 0 {
             client.transfer(&vault, &from, &amount);
         }
         Self::touch(&env, &from);
 
         amount
     }
 
     /// Move `shares` between two holders.

---- test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor stdout ----

thread 'test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor' (2961261) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:105:5:
assertion `left == right` failed
  left: 992223
 right: 1000000
Writing test snapshot file for test "test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor" to "test_snapshots/test/deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor.1.json".

---- test::withdraw_returns_assets_and_burns_shares stdout ----

thread 'test::withdraw_returns_assets_and_burns_shares' (2961267) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:52:5:
assertion `left == right` failed
  left: 1000
 right: 600
Writing test snapshot file for test "test::withdraw_returns_assets_and_burns_shares" to "test_snapshots/test/withdraw_returns_assets_and_burns_shares.1.json".

---- test_invariants::i2_zero_supply_iff_empty stdout ----

thread 'test_invariants::i2_zero_supply_iff_empty' (2961277) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:40:5:
assertion `left == right` failed
  left: 1000
 right: 0
Writing test snapshot file for test "test_invariants::i2_zero_supply_iff_empty" to "test_snapshots/test_invariants/i2_zero_supply_iff_empty.1.json".

failures:
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i2_zero_supply_iff_empty

test result: FAILED. 19 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
