*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:221:9: replace Vault::pause with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::pause with ()
@@ -213,19 +213,17 @@
     pub fn set_admin(env: Env, new_admin: Address) {
         Self::require_admin(&env);
         env.storage().instance().set(&DataKey::Admin, &new_admin);
         Self::bump_instance(&env);
     }
 
     /// Halt all state-mutating entry points (I12). Only the admin may do this (I4).
     pub fn pause(env: Env) {
-        Self::require_admin(&env);
-        env.storage().instance().set(&DataKey::Paused, &true);
-        Self::bump_instance(&env);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     // ── Views ────────────────────────────────────────────────────────────────
 
     pub fn total_shares(env: Env) -> i128 {
         Self::total_shares_internal(&env)
     }

---- test::pause_sets_the_flag stdout ----

thread 'test::pause_sets_the_flag' (2967900) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:79:5:
assertion failed: f.vault().is_paused()
Writing test snapshot file for test "test::pause_sets_the_flag" to "test_snapshots/test/pause_sets_the_flag.1.json".

---- test_invariants::i12_pause_halts_all_mutations stdout ----

thread 'test_invariants::i12_pause_halts_all_mutations' (2967908) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:256:5:
deposit
Writing test snapshot file for test "test_invariants::i12_pause_halts_all_mutations" to "test_snapshots/test_invariants/i12_pause_halts_all_mutations.1.json".

---- test_invariants::i4_admin_operations_require_admin_auth stdout ----

thread 'test_invariants::i4_admin_operations_require_admin_auth' (2967978) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:70:5:
pause must fail without the admin's authorization
Writing test snapshot file for test "test_invariants::i4_admin_operations_require_admin_auth" to "test_snapshots/test_invariants/i4_admin_operations_require_admin_auth.1.json".

failures:
    test::pause_sets_the_flag
    test_invariants::i12_pause_halts_all_mutations
    test_invariants::i4_admin_operations_require_admin_auth

test result: FAILED. 19 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
