*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:233:9: replace Vault::balance_of -> i128 with 1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::balance_of -> i128 with 1
@@ -225,17 +225,17 @@
 
     // ── Views ────────────────────────────────────────────────────────────────
 
     pub fn total_shares(env: Env) -> i128 {
         Self::total_shares_internal(&env)
     }
 
     pub fn balance_of(env: Env, who: Address) -> i128 {
-        Self::balance_internal(&env, &who)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn admin(env: Env) -> Address {
         Self::admin_address(&env)
     }
 
     pub fn is_paused(env: Env) -> bool {
         env.storage()

---- test::views_report_state stdout ----

thread 'test::views_report_state' (2970314) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:88:5:
assertion `left == right` failed
  left: 1
 right: 250
Writing test snapshot file for test "test::views_report_state" to "test_snapshots/test/views_report_state.1.json".

---- test::initialize_sets_initial_state stdout ----

thread 'test::initialize_sets_initial_state' (2970310) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:17:5:
assertion `left == right` failed
  left: 1
 right: 0
Writing test snapshot file for test "test::initialize_sets_initial_state" to "test_snapshots/test/initialize_sets_initial_state.1.json".

---- test_invariants::i10_restoration_signature_is_detectable stdout ----

thread 'test_invariants::i10_restoration_signature_is_detectable' (2970317) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:212:5:
assertion `left == right` failed: data survives — auto-restoration, not TTL management
  left: 1
 right: 1000
Writing test snapshot file for test "test_invariants::i10_restoration_signature_is_detectable" to "test_snapshots/test_invariants/i10_restoration_signature_is_detectable.1.json".

failures:
    test::deposit_mints_one_to_one_on_empty_vault
    test::initialize_sets_initial_state
    test::transfer_shares_moves_balance
    test::views_report_state
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i10_restoration_signature_is_detectable
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i12_pause_halts_all_mutations
    test_invariants::i1_supply_conservation
    test_invariants::i5_user_operations_require_sender_auth
    test_invariants::i8_self_transfer_is_a_noop

test result: FAILED. 11 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
