*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:296:9: replace Vault::require_not_paused with ()

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::require_not_paused with ()
@@ -288,24 +288,17 @@
                 panic_with_error!(env, VaultError::NotInitialized);
             }
         }
 
         admin.require_auth();
     }
 
     fn require_not_paused(env: &Env) {
-        if env
-            .storage()
-            .instance()
-            .get(&DataKey::Paused)
-            .unwrap_or(false)
-        {
-            panic_with_error!(env, VaultError::Paused);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn require_positive(env: &Env, value: i128) {
         // I7 — non-positive amounts must be rejected outright. Accepting them is
         // the `bug_zero_amount` seed.
         #[cfg(not(feature = "bug_zero_amount"))]
         if value <= 0 {
             panic_with_error!(env, VaultError::InvalidAmount);

---- test_invariants::i12_pause_halts_all_mutations stdout ----

thread 'test_invariants::i12_pause_halts_all_mutations' (2974974) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:256:5:
deposit
Writing test snapshot file for test "test_invariants::i12_pause_halts_all_mutations" to "test_snapshots/test_invariants/i12_pause_halts_all_mutations.1.json".

failures:
    test_invariants::i12_pause_halts_all_mutations

test result: FAILED. 21 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
