*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:320:9: replace Vault::total_shares_internal -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::total_shares_internal -> i128 with -1
@@ -312,20 +312,17 @@
         }
         #[cfg(feature = "bug_zero_amount")]
         if value < 0 {
             panic_with_error!(env, VaultError::InvalidAmount);
         }
     }
 
     fn total_shares_internal(env: &Env) -> i128 {
-        env.storage()
-            .instance()
-            .get(&DataKey::TotalShares)
-            .unwrap_or(0)
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_total_shares(env: &Env, value: i128) {
         env.storage().instance().set(&DataKey::TotalShares, &value);
         Self::bump_instance(env);
     }
 
     fn balance_internal(env: &Env, who: &Address) -> i128 {

---- test_invariants::i12_pause_halts_all_mutations stdout ----

thread 'test_invariants::i12_pause_halts_all_mutations' (2978737) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(C

---- test::deposit_mints_proportionally_on_funded_vault stdout ----

thread 'test::deposit_mints_proportionally_on_funded_vault' (2978726) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error,

---- test_invariants::i10_persistent_entries_are_ttl_managed_not_restored stdout ----

thread 'test_invariants::i10_persistent_entries_are_ttl_managed_not_restored' (2978734) panicked at /Users/igorfambonatti/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-26.1.3/src/host.rs:907:9:
HostError: Error(Contract, #3)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #3)], data:["contract call failed", deposit, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, 1000]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAK3IM, topics:[error, Error(Contract, #3)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::deposit_mints_one_to_one_on_empty_vault
    test::deposit_mints_proportionally_on_funded_vault
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::initialize_sets_initial_state
    test::transfer_shares_moves_balance
    test::views_report_state
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i10_persistent_entries_are_ttl_managed_not_restored
    test_invariants::i10_restoration_signature_is_detectable
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i12_pause_halts_all_mutations
    test_invariants::i1_supply_conservation

test result: FAILED. 4 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
