*** 04-prototype-development/contracts/soroban-vault/src/lib.rs:393:9: replace Vault::checked_mul -> i128 with -1

*** mutation diff:
--- 04-prototype-development/contracts/soroban-vault/src/lib.rs
+++ replace Vault::checked_mul -> i128 with -1
@@ -385,23 +385,16 @@
     }
 
     fn checked_sub(env: &Env, a: i128, b: i128) -> i128 {
         a.checked_sub(b)
             .unwrap_or_else(|| panic_with_error!(env, VaultError::Overflow))
     }
 
     fn checked_mul(env: &Env, a: i128, b: i128) -> i128 {
-        #[cfg(feature = "bug_overflow")]
-        {
-            let _ = env;
-            return a.wrapping_mul(b);
-        }
-        #[cfg(not(feature = "bug_overflow"))]
-        a.checked_mul(b)
-            .unwrap_or_else(|| panic_with_error!(env, VaultError::Overflow))
+        -1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod testkit;
 mod test;
 mod test_invariants;

---- test::withdraw_returns_assets_and_burns_shares stdout ----

thread 'test::withdraw_returns_assets_and_burns_shares' (2986006) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:49:5:
assertion `left == right` failed
  left: 0
 right: 400
Writing test snapshot file for test "test::withdraw_returns_assets_and_burns_shares" to "test_snapshots/test/withdraw_returns_assets_and_burns_shares.1.json".

---- test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor stdout ----

thread 'test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor' (2986000) panicked at 04-prototype-development/contracts/soroban-vault/src/test.rs:104:5:
assertion `left == right` failed
  left: 0
 right: 7777
Writing test snapshot file for test "test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor" to "test_snapshots/test/deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor.1.json".

---- test_invariants::i11_temporary_state_is_never_authoritative stdout ----

thread 'test_invariants::i11_temporary_state_is_never_authoritative' (2986009) panicked at 04-prototype-development/contracts/soroban-vault/src/test_invariants.rs:243:5:
assertion `left == right` failed: withdraw unaffected by lost telemetry
  left: 0
 right: 500
Writing test snapshot file for test "test_invariants::i11_temporary_state_is_never_authoritative" to "test_snapshots/test_invariants/i11_temporary_state_is_never_authoritative.1.json".

failures:
    test::deposit_mints_proportionally_on_funded_vault
    test::deposit_withdraw_round_trip_is_lossless_for_a_sole_depositor
    test::withdraw_returns_assets_and_burns_shares
    test_invariants::i11_temporary_state_is_never_authoritative
    test_invariants::i1_supply_conservation
    test_invariants::i2_zero_supply_iff_empty
    test_invariants::i3_round_trip_never_profits

test result: FAILED. 15 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
